{
    "name": "Прерывания",
    "icon": "minecraft:comparator",
    "category": "minecontrollers:casm",
    "pages": [
        {
            "type": "patchouli:text",
            "text": "Существует два типа прерываний.$(br)Первый тип - это внутренние прерывания. Вы можете вызвать их с помощью INT $(l:minecontrollers:casm/interrupts#internal_ints)[<номер_прерывания>]$(). Вы можете ознакомиться со стандартной таблицей прерываний $(l:minecontrollers:casm/interrupts#internal_ints)здесь$().$(br)Второй тип - это внешние прерывания. Для этих прерываний используется зарезервированная таблица, на которую указывает регистр $(l:minecontrollers:casm/registers#it)IT$()."
        },
        {
            "type": "patchouli:text",
            "text": "Эта таблица представляет собой массив, в котором должно быть зарезервировано 64 слова (1 слово - 2 байта). Каждое слово в массиве привязано к выводам с одинаковым номером. Слово должно содержать абсолютный адрес прерывания, которое будет вызываться изменением редстоун сигнала на привязанном пине. Если значение слова равно 0, то контроллер не будет выполнять прерывание. Чтобы включить внешние прерывания, вам следует установить 1 в регистр flags."
        },
        {
            "type": "patchouli:text",
            "text": "$(bold)$(#ff0000)ОБРАТИТЕ ВНИМАНИЕ:$() никогда не устанавливайте IF в 1 до установки регистра IT на зарезервированую таблицу. В противном случае при каждом изменении редстоун сигнала на пинах, будет выполняться прерывание из ваших случайных областей кода.$(br)При вызове внешних прерываний микроконтроллер сохраняет регистры, подобно команде PUSHA и выполняет CALL по [<смещение_по_таблице_прерываний>]:0 адресу."
        },
        {
            "type": "patchouli:text",
            "text": "Чтобы восстановить ваши регистры и завершить прерывание, вы должны добавить этот код в конец вашего прерывания:$(br)$(bold)POPA$(br)RET 0, 0xFF$()$(br)Конечно, вы должны сбросить свой стек в состояние вызова прерывания, если вы работали с ним."
        },
        {
            "anchor": "internal_ints",
            "type": "patchouli:text",
            "title": "ТАБЛИЦА ВНУТР. ПРЕРЫВ.",
            "text": "$(li)$(bold)0$() - записывает значение игрового времени в регистры ax, bx, cx и dx. В порядке от старших разрядов к младшим.$(li)$(bold)1$() - записывает значение дневного времени в регистры ax, bx, cx и dx. В порядке от старших разрядов к младшим.$(li)$(bold)2$() - если сейчас день, то значение ax будет равно 1. В противном случае значение ax будет равно 0."
        },
        {
            "type": "patchouli:text",
            "text": "$(li)$(bold)3$() - если идет дождь, то значение ax будет равно 1. В противном случае значение ax будет равно 0.$(li)$(bold)4$() - если идет гром, то значение ax будет равно 1. В противном случае значение ax будет равно 0.$(li)$(bold)5$() - кладет синус и косинус, умноженные на 1000 в ax и bx соответственно. Угол определяется из ax в градусах.$(li)$(bold)6$() - возводит натуральный логарифм, умноженный на 1000 из ax в ax."
        },
        {
            "type": "patchouli:text",
            "text": "$(li)$(bold)7$() - возводит ax в степень bx / 1000. Деление на 1000 необходимо для работы с плавающими числами.$(li)$(bold)8$() - кладет случайное число в ax$(li)$(bold)9$() - помещает координаты микроконтроллера в стек.$(li)$(bold)10$() - задает локальные координаты первого блока относительно микроконтроллера, на который смотрит микроконтроллер в регистры bx, cx, dx, если блок не найден, то значение ax - 0,"
        },
        {
            "type": "patchouli:text",
            "text": "если найден - 1. Максимальное расстояние для наблюдения обычно равно 128.$(li)$(bold)11$() - подсчитывает количество игроков в радиусе ax. Результат помещается в ax. $(li)$(bold)12$() - возвращает хэш из имени игрока, по индексу bx, в пределах ax. Если хэш удалось извлечь ax - 1, результат хэша - bx, cx; в противном случае ax - 0. "
        },
        {
            "type": "patchouli:text",
            "text": "$(li)$(bold)13$() - возвращает координаты игрока, относительно микроконтроллера, по индексу bx, в пределах ax. Если координаты удалось извлечь ax - 1, bx, cx, dx - координаты по x, y и z соответственно.$(li)$(bold)14$() - возвращает количество сущностей в радиусе ax. Результат помещается в ax.$(li)$(bold)15$() - возвращает хэш из имени существа, по индексу bx, в пределах ax. Если хэш удалось извлечь ax - 1,"
        },
        {
            "type": "patchouli:text",
            "text": "результат хэша - bx, cx; в противном случае ax - 0$(li)$(bold)16$() - возвращает координаты сущности, относительно микроконтроллера, по индексу bx, в пределах ax. Если координаты удалось извлечь ax - 1, bx, cx, dx - координаты по x, y и z соответственно.$(li)$(bold)17$() - воспроизводит звук с тоном cx (500 - 1000) и радиусом из ax. bx содержит номер музыкального инструмента."
        },
        {
            "type": "patchouli:text",
            "title": "МУЗЫК. ИНСТРУМЕНТЫ",
            "text": "$(bold)0 - БАРАБАН$(br)1 - БАСС$(br)2 - КОЛОКОЛ$(br)3 - ЗВОН$(br)4 - ФЛЕЙТА$(br)5 - ГИТАРА$(br)6 - АРФА$(br)7 - ХЭТ$(br)8 - ПИАНИНО$(br)9 - МАЛЫЙ БАРАБАН$(br)10 - КСИЛОФОН$(br)11 - ЖЕЛЕЗНЫЙ КСИЛОФОН$(br)12 - КОРОВИЙ КОЛОКОЛЬЧИК$(br)13 - ДИДЖЕРИДУ$(br)"
        },
        {
            "type": "patchouli:text",
            "title": "МУЗЫК. ИНСТРУМЕНТЫ",
            "text": "$(bold)14 - БИТ$(br)15 - БАНДЖО$(br)16 - ЗОМБИ$(br)17 - СКЕЛЕТ$(br)18 - КРИПЕР$(br)19 - ЭНДЕР ДРАКОН$(br)20 - ВИЗЕР СКЕЛЕТ$(br)21 - ПИГЛИН$(br)"
        },
        {
            "type": "patchouli:text",
            "title": "ПРИМЕР ВНЕШН. ПРЕРЫВ.",
            "text": "$(bold)section .text$(br)mov ss, 0xFF$(br)mov bp, 0xFF$(br)mov sp, bp$(br)mov it, table_section$(br)mov [it], exint$(br)mov flags, 1$(br)mov ax, 5$(br)mov bx, 2$(br)mov cx, 500$(br)back:$(br)int 13"
        },
        {
            "type": "patchouli:text",
            "text": "$(bold)jmp back$(br)section exint$(br)jfe:$(br)cmp r0, 0$(br)jnz jfe$(br)popa$(br)ret 0, 0xFF$(br)section table_section$(br)dw 0 dup(64)"
        },
        {
            "type": "patchouli:text",
            "text": "В этом примере микроконтроллер звонит до тех пор, пока вы не установите белый пин на передней стороне контроллера на значение, отличное от 0. В этом случае микроконтроллер будет ждать, пока вы снова не установите пин 0 на 0."
        },
        {
            "type": "patchouli:text",
            "title": "ПРИМЕР ВНЕШН. ПРЕРЫВ.",
            "text": "$(bold)section .text$(br)mov ss, 0xFF$(br)mov bp, 0xFF$(br)mov sp, bp$(br)mov it, table_section$(br)mov ax, it$(br)add ax, 2$(br)mov [ax], exint$(br)mov flags, 1$(br)mov ax, 5$(br)mov bx, 2$(br)mov cx, 500$(br)back:$(br)int 13"
        },
        {
            "type": "patchouli:text",
            "text": "$(bold)jmp back$(br)section exint$(br)jfe:$(br)cmp r1, 0$(br)jnz jfe$(br)popa$(br)ret 0, 0xFF$(br)section table_section$(br)dw 0 dup(64)"
        },
        {
            "type": "patchouli:text",
            "text": "То же самое, что и в первом примере, но стоп-пин - оранжевого цвета (пин 1)."
        }
    ]
}