{
    "name": "Регистры",
    "icon": "minecraft:repeater",
    "category": "minecontrollers:casm",
    "pages": [
        {
            "type": "patchouli:text",
            "text": "Регистры - это энергозависимые ячейки памяти. При отключении питания регистры будут сброшены. Каждый регистр имеет свое значение, но это не значит, что вы не можете использовать их по своему усмотрению."
        },
        {
            "type": "patchouli:text",
            "title": "AX",
            "text": "Этот регистр используется в качестве накопителя для арифметических операций и для хранения значений для дальнейшего использования.$(br) Имеет такие подрегистры, как AH - регистр старших битов и AL - регистр младших битов."
        },
        {
            "type": "patchouli:text",
            "title": "BX",
            "text": "Обычно он служит для указания адреса в памяти или содержит данные. Также может использоваться как регистр AX.$(br) Имеет такие подрегистры, как BH - регистр старших разрядов и BL - регистр младших разрядов."
        },
        {
            "type": "patchouli:text",
            "title": "CX",
            "text": "Этот регистр используется в качестве счетчика для циклических операций. Также используется в циклической команде $(l:minecontrollers:casm/commands#loop)$().$(br) Имеет такие подрегистры, как CH - регистр старших разрядов и CL - регистр младших разрядов."
        },
        {
            "type": "patchouli:text",
            "title": "DX",
            "text": "Для арифметических операций и операций ввода-вывода. $(br) содержит такие подрегистры, как DH - регистр старших разрядов и DL - регистр младших разрядов."
        },
        {
            "type": "patchouli:text",
            "title": "DI",
            "text": "Указатель на место назначения при операциях с массивами."
        },
        {
            "type": "patchouli:text",
            "title": "SI",
            "text": "Указатель на источник во время операций с массивом."
        },
        {
            "anchor": "bp",
            "type": "patchouli:text",
            "title": "BP",
            "text": "Указатель на базу стека внутри функции. Он используется в SP и CS. Может быть полезен при рекурсиях и функциях, поскольку он статичен и может использоваться в качестве базы смещения для получения локальных данных и аргументов."
        },
        {
            "anchor": "sp",
            "type": "patchouli:text",
            "title": "SP",
            "text": "Указатель на вершину стека. Команда PUSH уменьшает значение регистра на 2 и переводит значение его операнда в адрес ss:sp. Команда POP очищает и возвращает данные из ss:sp в операнд команды и также увеличивает значение регистра на 2."
        },
        {
            "type": "patchouli:text",
            "title": "IP",
            "text": "Указатель на адрес текущей команды. Используя комбинацию cs:ip, вы можете узнать местоположение фрагмента кода в памяти.$(br)$(#ff0000)ВНИМАНИЕ: НЕ ПЫТАЙТЕСЬ ИЗМЕНИТЬ ЭТОТ РЕГИСТР САМОСТОЯТЕЛЬНО. РЕЗУЛЬТАТ МОЖЕТ БЫТЬ НЕПРЕДСКАЗУЕМЫМ."
        },
        {
            "type": "patchouli:text",
            "title": "FLAGS",
            "text": "Этот регистр содержит флаги, которые изменяются и используются командами. Все флаги имеют размер в 1 бит, а следующий список будет содержать последовательность от старших к младшим битам.$(br2)$(bold)FLAGS:$()$(li)$(bold)CF$() - флаг переноса. Он устанавливается, если происходит переполнение без знака, то есть когда сумма"
        },
        {
            "type": "patchouli:text",
            "text": "переносится или вычитается при заимствовании (например, когда числа 0FFh и 1 суммируются командой ADD). Если переполнения не происходит, то флаг не устанавливается.$(li)$(bold)ZF$() - нулевой флаг. Устанавливается, если результат вычисления равен 0.$(li)$(bold)SF$() - знаковый флаг. Устанавливается, если старший бит результата равен 1.$(li)$(bold)IF$() - флаг прерывания. Он позволяет использовать внешние прерывания, если для него установлен в 1."
        },
        {
            "anchor": "segments",
            "type": "patchouli:text",
            "title": "СЕГМЕНТНЫЕ РЕГИСТРЫ",
            "text": "Сегментные регистры играют ключевую роль в сегментации. Вы можете работать со смещениями, только используя эти регистры. Каждый сегментный регистр управляет собственной кодовой областью.$(br2)$(bold)DS$() - указывает на ваш сегмент данных, в котором вы будете хранить переменные и массивы. Является смещением по умолчанию для меток."
        },
        {
            "type": "patchouli:text",
            "text": "$(bold)SS$() - указывает на сегмент стека. Это смещение по умолчанию для регистров sp и bp.$(br2)$(bold)CS$() - указывает на сегмент кода. обычно используется с регистром ip для получения абсолютного адреса текущей команды.$(br)$(#ff0000)ПРЕДУПРЕЖДЕНИЕ: НЕ ПЫТАЙТЕСЬ ИЗМЕНИТЬ ЭТОТ РЕГИСТР САМОСТОЯТЕЛЬНО. РЕЗУЛЬТАТ МОЖЕТ БЫТЬ НЕПРЕДСКАЗУЕМЫМ.$()$(br2)$(bold)ES$() - этот регистр используется для хранения дополнительного сегмента."
        },
        {
            "type": "patchouli:text",
            "title": "РЕГИСТРЫ ПИНОВ",
            "text": "Эти регистры позволяют считывать и записывать пины. Для использования регистров этого типа вам следует использовать r[<номер_пина>]."
        },
        {
            "anchor": "it",
            "type": "patchouli:text",
            "title": "IT",
            "text": "Необычный регистр, который указывает на таблицу прерываний. Для активации внешних прерываний установите значение IF равным 1."
        }
    ]
}