{
    "name": "Отладка",
    "icon": "minecontrollers:controller_debug_display",
    "category": "minecontrollers:microcontroller",
    "pages": [
        {
            "type": "patchouli:text",
            "text": "Микроконтроллер - это черный ящик, с которым вы обычно не можете взаимодействовать. Но иногда хочется заглянуть внутрь, чтобы исправить свои ошибки или изучить механизмы работы микроконтроллера.$(br)К счастью, есть несколько способов сделать это.$(li)Вы можете просто прописать в коде механизмы отладки,"
        },
        {
            "type": "patchouli:text",
            "text": "такие как включение определённых пинов или воспроизведение определенного звука в нужный момент. У этого способа есть свои плюсы, но он требует машинного времени, а значит, медленный микроконтроллер будет работать еще медленнее.$(li)Второй способ означает, что вы должны использовать $(l:minecontrollers:microcontroller/pinout#special_pins)специальные пины$(). Просто считывайте нужные ячейки из памяти. Это, пожалуй, худший способ отладки вашей программы"
        },
        {
            "type": "patchouli:text",
            "text": "потому что вам придется преобразовать выходное значение, и вы не сможете прочитать значения регистров.$(li)Последний способ является более предпочтительным и рекомендуемым, он заключается в использовании $(l:minecontrollers:microcontroller/debug#debugger_icon)отладчика$()."
        },
        {
            "anchor": "debugger_icon",
            "type": "patchouli:spotlight",
            "item": "minecontrollers:controller_debug_display",
            "text": "С помощью отладчика вы можете изучить свой микроконтроллер и получить всю полезную информацию. Для отладки вам нужно щелкнуть по отладчику в основной руке по микроконтроллеру, и отладчик выведет все данные о регистрах и небольшой дамп памяти."
        },
        {
            "type": "patchouli:text",
            "text": "Чтобы определить начальный адрес дампа памяти, вам необходимо нажать $(bold)[SHIFT]$() затем начните прокручивать колесико мыши.$(br)Чтобы выбрать режим прокрутки, вам нужно нажать $(bold)ПКМ$(), пока вы продолжаете удерживать $(bold)[SHIFT]$()."
        }
    ]
}