{
    "name": "Чтение и запись",
    "icon": "minecontrollers:microcontroller",
    "category": "minecontrollers:microcontroller",
    "pages": [
        {
            "type": "patchouli:text",
            "text": "Микроконтроллеры могут обмениваться данными между собой. Эта возможность достигается за счет $(l:minecontrollers:microcontroller/pinout#special_pins)32-37 пинов$().$(br)Для записи данных в микроконтроллер вы можете использовать 36 пин. Для считывания данных с микроконтроллера вы можете использовать 37 пин."
        },
        {
            "type": "patchouli:text",
            "title": "Канальный уровень",
            "text": "Если вы уже прочитали о $(l:minecontrollers:basics/bundled_wires)morered кабелях$() вы, наверное, уже поняли, что при записи или чтении данных вам придется обращать внимание на влияние длины кабеля на редстоун сигнал, который может исказить исходные данные. Чтобы избежать искажения данных, вам следует использовать кабельное реле из morered. Это приведет к искажению данных на 2 постоянных уровня."
        },
        {
            "type": "patchouli:text",
            "text": "Это поведение было учтено, поэтому микроконтроллер автоматически увеличит объем данных из памяти на 2 для обоих $(l:minecontrollers:microcontroller/pinout#special_pins)числовых пинов$(), когда $(l:minecontrollers:microcontroller/pinout#special_pins)37 пин$() получает редстоун импульс.$(br2)На следующей странице вы можете увидеть схему с использованием этих пинов."
        },
        {
            "type": "patchouli:image",
            "images": ["minecontrollers:textures/gui/guidebook/io_example.png"],
            "text": "GEN - генератор частоты от 2 наблюдателей. Задает частоту выполнения команд."
        },
        {
            "type": "patchouli:text",
            "text": "L1 - рычаг питания. Он подключен к $(l:minecontrollers:microcontroller/pinout#special_pins)41 пину$() и питает все микроконтроллеры.$(br2)L2 - рычаг считывания. Подключен к $(l:minecontrollers:microcontroller/pinout#special_pins)39 пину$().$(br2)C1 - микроконтроллера, который мы хотим прочесть. Поскольку схема не содержит редстоун источников для$(l:minecontrollers:microcontroller/pinout#special_pins)32-35 пинов$(), текущий адрес, который мы читаем - 0."
        },
        {
            "type": "patchouli:text",
            "text": "C2 - промежуточный микроконтроллер, который уже был прошит. Он запитывает свой 6 пин для активации 38 пина на C3, а также передает сигналы с обратной стороны на переднюю, за исключением 39 пина, чтобы избежать считывания данных с контроллера C3.$(br2)C3 - микроконтроллер в который мы хотим записать данные с C1."
        },
        {
            "type": "patchouli:text",
            "text": "Вы также можете поэкспериментировать с I/O пинами. Это позволяет копировать данные между контроллерами на аппаратном уровне. В то же время вы можете использовать микроконтроллер в качестве диска для расширения памяти вашего основного микроконтроллера."
        },
        {
            "type": "patchouli:image",
            "images": ["minecontrollers:textures/gui/guidebook/io_example_2.png"]
        }
    ]
}